{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_page_title":true}},"ccf347bb-8438-47d6-857c-96f66600a1f0":{"type":"section-images-tabs","blocks":{"41e76e2b-a6a8-47d7-ac89-a7e5f6f9b34f":{"type":"text","settings":{"title":"Costume Hire - Full Terms & Conditions","text":"<p><strong>The short version<\/strong><\/p><p>Rather stick pins in your eyeballs whilst chewing on cut glass & fire-walking at an Anthony Robbins retreat, than read legal guff? Us too…<\/p><p>Here’s the guts of what you need to know:<\/p><ul><li>To hire, you need to supply I.D. that includes proof of address (eg. drivers’ licence), plus provide either cash or credit card details for us to hold on file as a security bond.<\/li><li>Take good care of our costumes & try & keep your clothes on at your event – if damage or lose something, be prepared to pay market replacement cost – & be aware that for custom made items this can be expensive.<\/li><li>Don’t wash them – especially if you stain them. You can wash it in & make it harder for us to get it out. We’re pretty good at stain removal however if it comes to it, we have a better rate with the local dry-cleaner than you do & will pass this on to you.<\/li><li>Bring everything back on time & be prepared to pay the late fee if you don’t. We do everything we can to make returns hassle free, including late opening hours & a courier service. It’s only fair to the next person who’s booked it, plus to our other customers during the week who deserve our full attention rather than having us stuck in the laundry cleaning late returns.<\/li><\/ul><p><strong>The long version<\/strong><\/p><p>Hire of any costume from Fancy That! Costumes is entered into by the Hirer on an understanding of the following conditions:<\/p><ul><li>Pick up & return dates are as written and agreed on the Tax Invoice.<\/li><li>Notwithstanding the above, the standard hire period is 3 days ie. Mon – Wed, Tue – Thu, Wed –Fri, unless you are picking up for weekend use, in which case pick up may be made from Thursday onwards, with return due by close of business the following Monday.<\/li><li>Clause 2 above excludes Easter, Christmas & the peak Nov-Dec season each year, which have their own terms as follows:<\/li><li>Costumes may be reserved by phone or in person with a $44 \/ $22 (adults \/ kids) non-refundable deposit. In the event of cancellation, the deposit is forfeited.<\/li><li>A bond applies to every hire, equal to the amount as written on the Tax Invoice & may be taken in one of two ways:<\/li><li>Once a costume has left the store, no refund is available.<\/li><li>Fancy That! Costumes is to be paid in full, in advance of taking possession of the goods.<\/li><li>The hiring period shall commence from the day the goods are collected by the hirer or forwarded to the hirer from Fancy That! Costumes’ premises. Hire goods not received by close of business on the due return date will be subject to late fees as follows:<\/li><li>These terms are subject to change without notice. The hirers’ signature on the hire docket signifies acceptance of these terms.<\/li><\/ul>"}},"a88b0088-606a-4e13-8e88-ff7a1cc4c5f5":{"type":"text","settings":{"title":"I'm not in Sydney - can I hire from you?","text":"<p>No.<\/p>"}},"38857536-2a7e-4b62-b672-2e62e025ccf8":{"type":"text","settings":{"title":"What is your average hire fee?","text":"<p>The average costume hire for adults is $79 & ranges from our minimum hire of $22 up to $150 for our Deluxe Collectors Edition Batman, a licensed costume which retails on some sites for up to $800.<\/p><p>Once you’ve decided on a basic theme, we’ll generously style you up with all the accessories you need to look fabulous. Character costume wigs (where the wig is essential to the character) are generally included in the hire fee – if an item is included, you’ll see it itemised on the listing.<\/p><p>Where you choose to hire a wig that is not included in the standard costume price, it’s an additional $10. The same applies to shoes.<\/p>"}},"de92115f-9c8e-4367-81c9-11d02459add4":{"type":"text","settings":{"title":"Do you have group discounts?","text":"<p>Yes!  We offer a 15% discount on group hires of 5 or more costumes where all 5 costumes are booked at the same time, for the same event. Check out our Popular Groups page for group costume ideas.<\/p>"}},"17caf7bb-822a-4855-8610-2a08fbce6b47":{"type":"text","settings":{"title":"Do you hire wigs out on their own?","text":"<p>Yes!  When hiring wigs on their own without a costume, cost is $25. The exception to this is our Judges’ wigs, which are $45 to hire on their own (man – it takes a long time to style those curls right!). The price difference for hiring wigs on their own versus with a costume (where it’s only $10) is due to the fact that it does take time to wash & style the wigs & there is no hire revenue to offset this cost.<\/p><p>Whilst our hire wigs are generally superior quality to our sale wigs, it can be more economical to purchase if we have a similar style in our sales range. You can view our available sales wigs online <a href=\"https:\/\/fancythat.neto.com.au\/product-category\/products\/wigs\/\">here<\/a>. Sales wigs are available to try before you buy instore, & to purchase both instore & online.<\/p>"}},"c7c941a2-4ab1-4218-84f4-b10172ec52cd":{"type":"text","settings":{"title":"How long is the standard hire period?","text":"<p>Our standard hire period for weekend events is Wed to Mon, with return due on Monday whether you collect on Wed, Thurs, Fri or Sat.<\/p><p>Mid week, it’s 3 days eg Mon – Wed, Tue – Thur.<\/p><p>Additional days are available at $22 per day. Should you wish to retain the costume for more than 3 additional days, it becomes a double hire. See Conditions of Hire for details.<\/p><p>We do aim to be flexible re this in the traditionally quieter months of Jan & Feb each year, where many companies hold offsite conferences & returning within a shorter timeframe can be difficult.<\/p>"}},"8c3e73ba-1e71-4d4c-b953-8b856b99ecfa":{"type":"text","settings":{"title":"How far in advance do I need to book a hire costume?","text":"<p>First in, best dressed!  Earlier is always better.<\/p><p>Costumes are available to collect for weekend events from Wednesday of that week. If you’re planning further ahead, the best times to come in are Wed or Thurs as the majority of our costumes are returned, prepped & ready to try on by that stage.<\/p><p>Don’t forget, our “Hassle Free Hire” same-day courier service in Sydney means you only need come in once to make your selection, then let our courier service handle the delivery & collection for you. And if you can’t make it in at all, we can also handle the lot for you remotely.<\/p>"}},"4d55a03e-97e9-4087-a17f-65e9d852942d":{"type":"text","settings":{"title":"Can I hire items online?","text":"<p>No.<\/p><p>We have a busy bricks & mortar store with people in & out trying costumes on all the time. We’re working to leverage technology as much as we can, however imagine if you were in the change-room & someone had booked your chosen costume online before you’d had the chance to put your pants back on?! Not a good look…<\/p><p>In addition, a lot of what we offer at Fancy That! is one-on-one styling with mix & match, one-off accessories. It’s pretty tricky to automate.<\/p><p>If you see something you like online, you can reserve it with us over the phone by providing a $44 non-refundable holding deposit. We will just need to site your licence or photo I.D. when you come instore to collect – or have you forward a scanned copy of same to us via email, if you require costume delivery.<\/p>"}},"1780529b-b832-4bb2-85ce-c4d61e8dd188":{"type":"text","settings":{"title":"What is a hire bond & why do you need it?","text":"<p>The bond provides security for us that the costume is going to be returned in the same condition as it was hired. Any item loss or damage repair bill is deducted from the bond. Please note, in cases of full loss or extreme damage, we reserve the right to recoup replacement or repair costs in addition to the bond figure. We accept credit card or cash bonds as follows:<\/p><ul><li>Credit card: no money is withdrawn – your card details are simply held on file then destroyed upon safe return of the costume<\/li><li>Cash: cash bond taken on collection then returned on costume return<\/li><\/ul><p>We prefer Credit Card bonds for their security & simplicity. If all is in order, we simply destroy your details upon costume return.<\/p>"}},"4a9991a0-6bae-4d36-9614-a07dbb010ee7":{"type":"text","settings":{"title":"Can you deliver my hire costume?","text":"<p>Yes, if you live the the greater Sydney metro area (no hire outside of Sydney).<\/p><p>We keep Flash Couriers busy running all over town with obscure purple “body bags” on a daily basis (!)<\/p><p>We do recommend you come in to try the costume on first – in our experience, body shape is more relevant than label size, which can be misleading.  Also, once a hire costume leaves our premises we are unable to refund your hire fee.<\/p>"}},"a502eaef-d24a-4545-9ede-c6fab2c2eda4":{"type":"text","settings":{"title":"Do I have to clean the hire costumes?","text":"<p>Please don’t! This is all part of the service. We have special cleaning techniques to ensure the longevity of our items plus, if you attempt to wash out a stain yourself, you can actually sometimes wash it “in”, which makes it harder for us to remove.<\/p><p>Our hire costumes are thoroughly washed in individual laundry bags with industrial strength cleansing solution or dry cleaned, after EVERY use. Our wigs are soaked in a mixture of fabric softener & disinfectant after EVERY use, then styled ready for re-hire. Accessories & hats are wiped down with dilute disinfectant then left to air dry.<\/p>"}},"4f58952e-b71c-4afa-8487-5b3043f68584":{"type":"text","settings":{"title":"Do you have an after hours hire return box?","text":"<p>No.<\/p><p>We do stay open until 7pm Mon – Wed, 8pm Thurs & 6pm Fri to make it easier for you to return your costume. We also have a “Hassle Free Hire” courier service to make returns super easy for you. Click here for details<\/p>"}},"c00d0f26-a20e-4f43-96ef-7464caa412b1":{"type":"text","settings":{"title":"What happens if I'm late returnng a hire?","text":"<p>Late fees are charged at $22 per day.<\/p><p>This is not a revenue raising exercise. As you can imagine, a costume hire business runs to a strict weekly rhythm of washing & dry cleaning to ensure all items are available for selection during the week, & for event pick-up. The late fee is an incentive to encourage prompt return. It recognises the fact that:<\/p><ul><li>we employ staff on Tuesdays to power through costume prep ready for the next weekend onslaught;<\/li><li>new customers need to be able to try on freshly laundered costumes for selection during the week; &<\/li><li>new customers deserve our full attention instore, which we can’t provide to them if we’re busy processing & washing late returns.<\/li><\/ul><p>We do everything we can to make returns hassle free, including late opening hours & a courier service. We appreciate our customers honoring their hire contract agreement & doing the right thing also.<\/p>"}},"d6a4d216-3b94-4a87-9df4-b88443677055":{"type":"text","settings":{"title":"Do you have a Make-up & Special FX service?","text":"<p>No.  But we can recommend some great Make-up artists to you.  Further information launching on this site shortly in our \"Party Partners\" section. <\/p>"}},"6a195f64-5793-4b54-aab6-e5d39ff91c8b":{"type":"text","settings":{"title":"Do you hire props?","text":"<p>No.  We recommend Sydney Prop Specialists in Marrickville for their phenomenal range, quality & service. Their website is super easy to navigate, with a range curated over more than 30 years servicing special event, theatrical, film TV & exhibition industries in Sydney & Australia-wide. With thousand of unique items & the capacity to source or custom make for you, you could easily be overwhelmed, were it not for their intuitively laid out website plus stylists onhand to interpret your brief.<\/p><p>Whether yours is a small, private event or a large corporate soiree – take it to the next level with quality costumes from Fancy That! Costumes & prop hire or fully-fledged event theming from Sydney Prop Specialists.<\/p>"}}},"block_order":["41e76e2b-a6a8-47d7-ac89-a7e5f6f9b34f","a88b0088-606a-4e13-8e88-ff7a1cc4c5f5","38857536-2a7e-4b62-b672-2e62e025ccf8","de92115f-9c8e-4367-81c9-11d02459add4","17caf7bb-822a-4855-8610-2a08fbce6b47","c7c941a2-4ab1-4218-84f4-b10172ec52cd","8c3e73ba-1e71-4d4c-b953-8b856b99ecfa","4d55a03e-97e9-4087-a17f-65e9d852942d","1780529b-b832-4bb2-85ce-c4d61e8dd188","4a9991a0-6bae-4d36-9614-a07dbb010ee7","a502eaef-d24a-4545-9ede-c6fab2c2eda4","4f58952e-b71c-4afa-8487-5b3043f68584","c00d0f26-a20e-4f43-96ef-7464caa412b1","d6a4d216-3b94-4a87-9df4-b88443677055","6a195f64-5793-4b54-aab6-e5d39ff91c8b"],"settings":{"text_position":"left","text_alignment":"center","images_width":750,"images_offset":60,"image_1":"shopify:\/\/shop_images\/2019-08-17.jpg","image_1_position":"center-center","image_link_1":"","image_2_position":"center-center","image_link_2":"","hide_image_2":false,"accordion_title":"Costume Hire FAQ - Fancy That","accordion_text":"<p>Email us or call us on 02 9906 6135 if there’s anything you want to know that we haven’t covered below.<\/p><p>Read below for full Hire Terms & Conditions or <a href=\"https:\/\/www.fancythatcostumes.com.au\/conditions-of-hire\/\">Click here for hire FAQ<\/a><\/p>","video_btn_text":"","video_btn_url":""}},"4dbb7227-57b1-4082-bac6-90cd387f2adb":{"type":"section-text","blocks":{"31fdbd22-6323-4792-aaa5-f9501569b9c0":{"type":"button","settings":{"btn_text":"FAQs","btn_link":"shopify:\/\/pages\/faq","btn_style":"primary btn--small"}},"2ad410b1-e4e0-4caf-bcc7-58470eadacc8":{"type":"button","settings":{"btn_text":"Balloon FAQs","btn_link":"shopify:\/\/pages\/balloon-faqs","btn_style":"primary btn--small"}},"template--17719089103147__4dbb7227-57b1-4082-bac6-90cd387f2adb-1674446511cf3a29ad-3":{"type":"button","settings":{"btn_text":"Costume Purchase FAQ","btn_link":"shopify:\/\/pages\/costume-purchase-faq","btn_style":"primary btn--small"}}},"block_order":["31fdbd22-6323-4792-aaa5-f9501569b9c0","2ad410b1-e4e0-4caf-bcc7-58470eadacc8","template--17719089103147__4dbb7227-57b1-4082-bac6-90cd387f2adb-1674446511cf3a29ad-3"],"settings":{"text_position":"center","wrapper":"narrow","padding":"standard-padding","bg_color":"","text_color":"text-dark"}},"defb21a0-a620-45bd-8315-9c4549f8dec8":{"type":"section-newsletter","settings":{"flex_align":"align--middle-center","wrapper":"full","text_color":"text-light","title":"Join the Party!","text":"<p>Sign-up for exclusive offers, sales & event alerts.<\/p>","extra_fields":"","button_text":"","bg_color":"#e20d66","image_height":"three-fifty-height","image_position":"center-center","overlay_opacity":10}}},"order":["main","ccf347bb-8438-47d6-857c-96f66600a1f0","4dbb7227-57b1-4082-bac6-90cd387f2adb","defb21a0-a620-45bd-8315-9c4549f8dec8"]}